app/controllers/mychest_controller.rb

  def index
    @my_apps = current_user.applics
    @market_apps = Applic.all
---
SELECT `applics`.* FROM `applics`

  def remove_all
    applics = Applic.all
    for a in applics
      if current_user.applics.include?(a)
---
SELECT `applics`.* FROM `applics`
SELECT 1 FROM `applics` INNER JOIN `applics_users` ON `applics`.`id` = `applics_users`.`applic_id` WHERE `applics_users`.`user_id` = 1 AND `applics`.`id` = 1 LIMIT 1

  def install_all
    applics = Applic.all
    for a in applics
      unless current_user.applics.include?(a)
---
SELECT `applics`.* FROM `applics`
SELECT 1 FROM `applics` INNER JOIN `applics_users` ON `applics`.`id` = `applics_users`.`applic_id` WHERE `applics_users`.`user_id` = 1 AND `applics`.`id` = 1 LIMIT 1

  def install_app
    applic = Applic.find(params[:id])
---
SELECT "applics".* FROM "applics" WHERE "applics"."id" = ? LIMIT 1  [["id", "3"]]

  def remove_app
    applic = Applic.find(params[:id])
---
SELECT "applics".* FROM "applics" WHERE "applics"."id" = ? LIMIT 1  [["id", "3"]]