app/views/mychest/_list_market_apps.html.erb

	    	<!-- specify DROP or nodrop -->
	    	<% if current_user.applics.include?(app)%>
---
SELECT 1 FROM `applics` INNER JOIN `applics_users` ON `applics`.`id` = `applics_users`.`applic_id` WHERE `applics_users`.`user_id` = 1 AND `applics`.`id` = 1 LIMIT 1